Revit 2016 API
LoadCombination.CombinationCaseName Property
Returns load combination case name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetCaseAndCombinationIds() method instead.")]
public string this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetCaseAndCombinationIds() method instead.")> _
Public ReadOnly Property CombinationCaseName ( _
	index As Integer _
) As String
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetCaseAndCombinationIds() method instead.")]
public:
property String^ CombinationCaseName[int index] {
	String^ get (int index);
}
Parameters
index
Type: System.Int32
The index of load case.
Remarks
The index should be not less then 0 and be less than load cases count.
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace